.emacs.d/README.org
#+TITLE: My Emacs Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el
#+STARTUP: overview

* Introduction

  put ~#+PROPERTY: header-args:emacs-lisp :tangle ./init-new.el~ at the top of your ~org~ file, then after running ~org-babel-tangle (C-c C-v t)~ (this can be [[*Tangle Config Files][automated]] -- to be executed on save), the lisp blocks will be written to your ~init-new.el~ file.

* Basic

** Packages

*** package archives

set your package archives here, and enable use-package.

I'm in China, so here I use [[https://mirrors.tuna.tsinghua.edu.cn/help/elpa/][tsinghua tuna]].

#+begin_src emacs-lisp
  ;; Initialize package sources
  (require 'package)

  (let (;; tsinghua
        (archives '("http://mirrors.tuna.tsinghua.edu.cn/elpa/melpa/"
                    "http://mirrors.tuna.tsinghua.edu.cn/elpa/org/"
                    "http://mirrors.tuna.tsinghua.edu.cn/elpa/gnu/"))
        ;; ustc
        (archives '("http://mirrors.ustc.edu.cn/elpa/melpa/"
                    "http://mirrors.ustc.edu.cn/elpa/org/"
                    "http://mirrors.ustc.edu.cn/elpa/gnu/"))
        ;; official
        ;; (archives '("https://melpa.org/packages/"
        ;;             "http://orgmode.org/elpa/"
        ;;             "https://elpa.gnu.org/packages/"))
        )
    (setq package-archives `(("melpa" . ,(nth 0 archives))
                             ("org" . ,(nth 1 archives))
                             ("gnu" . ,(nth 2 archives)))))

  (package-initialize)
#+end_src

*** use-package

[[https://jwiegley.github.io/use-package/keywords/][use-package keywords]]

#+begin_src emacs-lisp
  ;; https://www.reddit.com/r/emacs/comments/1rdstn/set_packageenableatstartup_to_nil_for_slightly/
  (setq package-enable-at-startup nil)

  (unless package-archive-contents
    (package-refresh-contents))

    ;; Initialize use-package on non-Linux platforms
  (unless (package-installed-p 'use-package)
    (package-install 'use-package))

  (require 'use-package)
  (setq use-package-always-ensure t)
#+end_src

** simpler UI

#+begin_src emacs-lisp
  ;; Produce backtraces when errors occur: can be helpful to diagnose startup issues
  ;; (setq debug-on-error t)
  (add-to-list 'load-path (expand-file-name "lisp" user-emacs-directory))
  (add-hook 'after-init-hook 'electric-pair-mode)
  (add-hook 'after-init-hook 'electric-indent-mode)
  (add-hook 'after-init-hook 'global-auto-revert-mode)
  (use-package autorevert
    :diminish)
  (setq global-auto-revert-non-file-buffers t
        auto-revert-verbose nil)

  ;; default values
  (setq-default
   help-window-select t
   ;; only enable trailing whitespaces in some modes
   show-trailing-whitespace nil
   buffers-menu-max-size 30
   case-fold-search t
   column-number-mode t
   ediff-split-window-function 'split-window-horizontally
   ediff-window-setup-function 'ediff-setup-windows-plain
   indent-tabs-mode nil
   create-lockfiles nil
   auto-save-default nil
   make-backup-files nil
   mouse-yank-at-point t
   save-interprogram-paste-before-kill t
   scroll-preserve-screen-position 'always
   set-mark-command-repeat-pop t
   tooltip-delay 1.5
   truncate-lines nil
   truncate-partial-width-windows nil)
#+end_src

** Startup Performance

*** garbage collection

Adjust garbage collection threashold for startup and after, garbage collection happens more frequently but in less time

#+begin_src emacs-lisp
  ;; Adjust garbage collection thresholds during startup, and thereafter
  (let ((normal-gc-cons-threshold (* 20 1024 1024))
        (init-gc-cons-threshold (* 128 1024 1024)))
    (setq gc-cons-threshold init-gc-cons-threshold)
    (add-hook 'emacs-startup-hook
              (lambda () (setq gc-cons-threshold (* 20 1024 1024)))))
#+end_src

*** Display startup time

#+begin_src emacs-lisp
  (defun k4i/display-startup-time ()
    (message "init completed in %s with %d garbage collections."
             (format "%.2f seconds"
                     (float-time
                      (time-subtract after-init-time before-init-time)))
             gcs-done))

  (add-hook 'after-init-hook #'k4i/display-startup-time)
#+end_src

** TODO search tools

=("rg" "ag" "pt" "ack" "grep")=

* Keep Folders Clean

We use the [[https://github.com/emacscollective/no-littering/blob/master/no-littering.el][no-littering]] package to keep folders where we edit files and the Emacs configuration folder clean!  It knows about a wide variety of variables for built in Emacs features as well as those from community packages so it can be much easier than finding and setting these variables yourself.

#+begin_src emacs-lisp
  ;; NOTE: If you want to move everything out of the ~/.emacs.d folder
  ;; reliably, set `user-emacs-directory` before loading no-littering!
  ;(setq user-emacs-directory "~/.cache/emacs")

  (use-package no-littering)

  ;; no-littering doesn't set this by default so we must place
  ;; auto save files in the same path as it uses for sessions
  (setq auto-save-file-name-transforms
        `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))
#+end_src

* Keybinding

** define-key & global-set-key

#+begin_src emacs-lisp
  (global-set-key (kbd "C-x C-b") 'ibuffer)
#+end_src

** evil mode
This configuration uses [[https://evil.readthedocs.io/en/latest/index.html][evil-mode]] for a Vi-like modal editing experience.  [[https://github.com/noctuid/general.el][general.el]] is used for easy keybinding configuration that integrates well with which-key.  [[https://github.com/emacs-evil/evil-collection][evil-collection]] is used to automatically configure various Emacs modes with Vi-like keybindings for evil-mode.

#+begin_src emacs-lisp
  ;; Make ESC quit prompts
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)

  (use-package undo-fu)
  (use-package evil
    :init
    ;; set these variables before evil-mode is loaded
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-want-C-u-scroll t)
    (setq evil-want-C-u-delete t)
    (setq evil-want-C-i-jump nil)
    (setq evil-undo-system 'undo-fu)
    :config
    (evil-mode 1)
    (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
    (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

    ;; Use visual line motions even outside of visual-line-mode buffers
    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal))

  (use-package evil-collection
    :after evil
    :config
    (evil-collection-init))
#+end_src

** general

*** leader

#+begin_src emacs-lisp
  (use-package general
    :after evil
    :config
    (general-create-definer my-space-leader
      :keymaps '(normal visual)
      :prefix "SPC")

    (my-space-leader
      "d" '(lambda () (interactive) (dired default-directory))
      "f"  '(:ignore t :which-key "file prefix")
      "fd" '(:ignore t :which-key "dotfiles prefix")
      "fde" '((lambda () (interactive) (find-file (expand-file-name "~/.dotfiles/.emacs.d/README.org"))) :which-key "emacs")
      "k" 'kill-this-buffer
      "o"  '(:ignore t :which-key "org prefix")
      "oa" 'org-agenda
      "oc" 'org-capture
      "r" 'resize-window
      "t"  '(:ignore t :which-key "toggles")
      "tt" '(counsel-load-theme :which-key "choose theme")
      "tf" 'treemacs
      "'" 'vterm-toggle-cd
      "=" 'format-all-buffer)

    (general-create-definer my-comma-leader
      :keymaps '(normal visual)
      :prefix ",")

    (my-comma-leader
      "k"  'kill-this-buffer))
#+end_src

*** major leader

use =,= as major mode leader key

** Which Key

[[https://github.com/justbur/emacs-which-key][which-key]] is a useful UI panel that appears when you start pressing any key binding in Emacs to offer you all possible completions for the prefix.  For example, if you press =C-c= (hold control and press the letter =c=), a panel will appear at the bottom of the frame displaying all of the bindings under that prefix and which command they run.  This is very useful for learning the possible key bindings in the mode of your current buffer.

#+begin_src emacs-lisp
  (use-package which-key
    :init
    (which-key-mode)
    :diminish which-key-mode
    :custom
    (which-key-idle-delay 0.3)
    :diminish which-key-mode)
#+end_src

