.emacs.d/init.el
;; Initialize package sources
(require 'package)

(let (;; tsinghua
      (archives '("http://mirrors.tuna.tsinghua.edu.cn/elpa/melpa/"
                  "http://mirrors.tuna.tsinghua.edu.cn/elpa/org/"
                  "http://mirrors.tuna.tsinghua.edu.cn/elpa/gnu/"))
      ;; ustc
      (archives '("http://mirrors.ustc.edu.cn/elpa/melpa/"
                  "http://mirrors.ustc.edu.cn/elpa/org/"
                  "http://mirrors.ustc.edu.cn/elpa/gnu/"))
      ;; official
      ;; (archives '("https://melpa.org/packages/"
      ;;             "http://orgmode.org/elpa/"
      ;;             "https://elpa.gnu.org/packages/"))
      )
  (setq package-archives `(("melpa" . ,(nth 0 archives))
                           ("org" . ,(nth 1 archives))
                           ("gnu" . ,(nth 2 archives)))))

(package-initialize)

;; https://www.reddit.com/r/emacs/comments/1rdstn/set_packageenableatstartup_to_nil_for_slightly/
(setq package-enable-at-startup nil)

(unless package-archive-contents
  (package-refresh-contents))

  ;; Initialize use-package on non-Linux platforms
(unless (package-installed-p 'use-package)
  (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure t)

;; Produce backtraces when errors occur: can be helpful to diagnose startup issues
;; (setq debug-on-error t)
(add-to-list 'load-path (expand-file-name "lisp" user-emacs-directory))
(add-hook 'after-init-hook 'electric-pair-mode)
(add-hook 'after-init-hook 'electric-indent-mode)
(add-hook 'after-init-hook 'global-auto-revert-mode)
(use-package autorevert
  :diminish)
(setq global-auto-revert-non-file-buffers t
      auto-revert-verbose nil)

;; default values
(setq-default
 help-window-select t
 ;; only enable trailing whitespaces in some modes
 show-trailing-whitespace nil
 buffers-menu-max-size 30
 case-fold-search t
 column-number-mode t
 ediff-split-window-function 'split-window-horizontally
 ediff-window-setup-function 'ediff-setup-windows-plain
 indent-tabs-mode nil
 create-lockfiles nil
 auto-save-default nil
 make-backup-files nil
 mouse-yank-at-point t
 save-interprogram-paste-before-kill t
 scroll-preserve-screen-position 'always
 set-mark-command-repeat-pop t
 tooltip-delay 1.5
 truncate-lines nil
 truncate-partial-width-windows nil)

;; Adjust garbage collection thresholds during startup, and thereafter
(let ((normal-gc-cons-threshold (* 20 1024 1024))
      (init-gc-cons-threshold (* 128 1024 1024)))
  (setq gc-cons-threshold init-gc-cons-threshold)
  (add-hook 'emacs-startup-hook
            (lambda () (setq gc-cons-threshold (* 20 1024 1024)))))

(defun k4i/display-startup-time ()
  (message "init completed in %s with %d garbage collections."
           (format "%.2f seconds"
                   (float-time
                    (time-subtract after-init-time before-init-time)))
           gcs-done))

(add-hook 'after-init-hook #'k4i/display-startup-time)

;; NOTE: If you want to move everything out of the ~/.emacs.d folder
;; reliably, set `user-emacs-directory` before loading no-littering!
;(setq user-emacs-directory "~/.cache/emacs")

(use-package no-littering)

;; no-littering doesn't set this by default so we must place
;; auto save files in the same path as it uses for sessions
(setq auto-save-file-name-transforms
      `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))

(global-set-key (kbd "C-x C-b") 'ibuffer)

;; Make ESC quit prompts
(global-set-key (kbd "<escape>") 'keyboard-escape-quit)

(use-package undo-fu)
(use-package evil
  :init
  ;; set these variables before evil-mode is loaded
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-want-C-u-scroll t)
  (setq evil-want-C-u-delete t)
  (setq evil-want-C-i-jump nil)
  (setq evil-undo-system 'undo-fu)
  :config
  (evil-mode 1)
  (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
  (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

  ;; Use visual line motions even outside of visual-line-mode buffers
  (evil-global-set-key 'motion "j" 'evil-next-visual-line)
  (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

  (evil-set-initial-state 'messages-buffer-mode 'normal)
  (evil-set-initial-state 'dashboard-mode 'normal))

(use-package evil-collection
  :after evil
  :config
  (evil-collection-init))

(use-package general
  :after evil
  :config
  (general-create-definer my-space-leader
    :keymaps '(normal visual)
    :prefix "SPC")

  (my-space-leader
    "d" '(lambda () (interactive) (dired default-directory))
    "f"  '(:ignore t :which-key "file prefix")
    "fd" '(:ignore t :which-key "dotfiles prefix")
    "fde" '((lambda () (interactive) (find-file (expand-file-name "~/.dotfiles/.emacs.d/README.org"))) :which-key "emacs")
    "k" 'kill-this-buffer
    "o"  '(:ignore t :which-key "org prefix")
    "oa" 'org-agenda
    "oc" 'org-capture
    "r" 'resize-window
    "t"  '(:ignore t :which-key "toggles")
    "tt" '(counsel-load-theme :which-key "choose theme")
    "tf" 'treemacs
    "'" 'vterm-toggle-cd
    "=" 'format-all-buffer)

  (general-create-definer my-comma-leader
    :keymaps '(normal visual)
    :prefix ",")

  (my-comma-leader
    "k"  'kill-this-buffer))

(use-package which-key
  :init
  (which-key-mode)
  :diminish which-key-mode
  :custom
  (which-key-idle-delay 0.3)
  :diminish which-key-mode)

(use-package ivy
  :after counsel
  :diminish
  :bind (("C-s" . swiper)
