.emacs.d/README.org
** Ivy and Counsel

[[https://oremacs.com/swiper/][Ivy]] is an excellent completion framework for Emacs.  It provides a minimal yet powerful selection menu that appears when you open files, switch buffers, and for many other tasks in Emacs.  Counsel is a customized set of commands to replace `find-file` with `counsel-find-file`, etc which provide useful commands for each of the default completion commands.

[[https://github.com/Yevgnen/ivy-rich][ivy-rich]] adds extra columns to a few of the Counsel commands to provide more information about each item.

#+begin_src emacs-lisp
  (use-package ivy
    :after counsel
    :diminish
    :bind (("C-s" . swiper)
           ("C-M-j" . ivy-switch-buffer)
           :map ivy-minibuffer-map
           ("TAB" . ivy-alt-done)
           ("C-l" . ivy-alt-done)
           ("C-j" . ivy-next-line)
           ("C-k" . ivy-previous-line)
           :map ivy-switch-buffer-map
           ("C-k" . ivy-previous-line)
           ("C-l" . ivy-done)
           ("C-d" . ivy-switch-buffer-kill)
           :map ivy-reverse-i-search-map
           ("C-k" . ivy-previous-line)
           ("C-d" . ivy-reverse-i-search-kill))
    :custom (ivy-use-virtual-buffers t)
    :config
    (ivy-mode 1))

  (use-package ivy-rich
    :after ivy
    :init
    (ivy-rich-mode 1))

  (use-package counsel
    :bind (:map minibuffer-local-map
           ("C-r" . 'counsel-minibuffer-history))
    :custom
    (counsel-linux-app-format-function #'counsel-linux-app-format-function-name-only)
    :config
    (counsel-mode 1))
#+end_src

*** Improved Candidate Sorting with prescient.el

prescient.el provides some helpful behavior for sorting Ivy completion candidates based on how recently or frequently you select them.  This can be especially helpful when using =M-x= to run commands that you don't have bound to a key but still need to access occasionally.

This Prescient configuration is optimized for use in System Crafters videos and streams, check out the [[https://youtu.be/T9kygXveEz0][video on prescient.el]] for more details on how to configure it!

#+begin_src emacs-lisp

  (use-package ivy-prescient
    :after counsel
    :custom
    (ivy-prescient-enable-filtering nil)
    :config
    ;; Uncomment the following line to have sorting remembered across sessions!
    ;(prescient-persist-mode 1)
    (ivy-prescient-mode 1))

#+end_src

** Helpful Help Commands

[[https://github.com/Wilfred/helpful][Helpful]] adds a lot of very helpful (get it?) information to Emacs' =describe-= command buffers.  For example, if you use =describe-function=, you will not only get the documentation about the function, you will also see the source code of the function and where it gets used in other places in the Emacs configuration.  It is very useful for figuring out how things work in Emacs.

#+begin_src emacs-lisp
  (use-package helpful
    :commands (helpful-callable helpful-variable helpful-command helpful-key)
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key))
#+end_src

** window

this is from [[https://www.emacswiki.org/emacs/WindowResize][emacswiki: WindowResize]]

#+begin_src emacs-lisp
  (defvar enlarge-window-height-char ?k)
  (defvar shrink-window-height-char ?j)
  (defvar enlarge-window-width-char ?l)
  (defvar shrink-window-width-char ?h)
  (defun resize-window (&optional arg)
     "Interactively resize the selected window.
  Repeatedly prompt whether to enlarge or shrink the window until the
  response is neither `enlarge-window-char' or `shrink-window-char'.
  When called with a prefix arg, resize the window by ARG lines."
     (interactive "p")
     ;; by default arg is 1, too slow to resize
     (setq arg 3)
     (let ((prompt (format "Enlarge/Shrink window (%c/%c/%c/%c)? "
                           enlarge-window-height-char shrink-window-height-char
                           enlarge-window-width-char shrink-window-width-char))
          response)
       (while (progn
               (setq response (read-event prompt))
               (cond ((equal response enlarge-window-height-char)
                      (enlarge-window arg)
                      t)
                     ((equal response shrink-window-height-char)
                      (enlarge-window (- arg))
                      t)
                     ((equal response enlarge-window-width-char)
                      (enlarge-window-horizontally arg)
                      t)
                     ((equal response shrink-window-width-char)
                      (enlarge-window-horizontally (- arg))
                      t)
                     (t nil))))
       (push response unread-command-events)))
#+end_src

* UI

** Basic

#+BEGIN_SRC emacs-lisp
  ;; adjust font size for your system
  (defvar k4i/default-font-size 200)
  (defvar k4i/default-variable-font-size 200)

  ;; Make frame transparency overridable
  ;; (defvar k4i/frame-transparency '(100 . 90))

  (setq inhibit-startup-message t)

  (scroll-bar-mode -1) ; Disable visible scrollbar
  (tool-bar-mode -1) ; Disable the toolbar
  (tooltip-mode -1) ; Disable tooltips
  (set-fringe-mode 10) ; Give some breathing room

  (menu-bar-mode -1) ; Disable the menu bar

  ;; Set up the visible bell
  (setq visible-bell t)

  ;; Set frame transparency
  ;; (set-frame-parameter (selected-frame) 'alpha k4i/frame-transparency)
  ;; (add-to-list 'default-frame-alist `(alpha . ,k4i/frame-transparency))
  (set-frame-parameter (selected-frame) 'fullscreen 'maximized)
  (add-to-list 'default-frame-alist '(fullscreen . maximized))

  (global-display-line-numbers-mode t)
  (column-number-mode) ; show column number
  ;; Disable line numbers for some modes
  (dolist (mode '(org-mode-hook
                  term-mode-hook
                  shell-mode-hook
                  eshell-mode-hook
                  treemacs-mode-hook))
      (add-hook mode (lambda () (display-line-numbers-mode 0))))
#+END_SRC

** Cursor

#+begin_src emacs-lisp
  (use-package beacon
    :custom
    (beacon-lighter "")
    (beacon-size 20)
    :config
    (beacon-mode 1))
#+end_src

** whitespaces

remove trailing whitespaces

#+begin_src emacs-lisp
  (defun k4i/show-trailing-whitespace ()
    "Enable display of trailing whitespace in this buffer."
    (setq-local show-trailing-whitespace t))

  (dolist (hook '(prog-mode-hook text-mode-hook conf-mode-hook))
    (add-hook hook 'k4i/show-trailing-whitespace))

  (add-hook 'before-save-hook
            'delete-trailing-whitespace)

  ;; M-SPC
  (global-set-key [remap just-one-space] 'cycle-spacing)
#+end_src

set whitespace display style (with =whitespace= package)

#+begin_src emacs-lisp
#+end_src

** Font

*** text

   #+BEGIN_SRC emacs-lisp
     (set-face-attribute 'default nil :font "DejaVu Sans Mono" :height k4i/default-font-size)

     ;; set the fixed pitch face
     (set-face-attribute 'fixed-pitch nil :font "DejaVu Sans Mono" :height 0.9)

     ;; Set the variable pitch face
     (set-face-attribute 'variable-pitch nil :font "Cantarell" :height 1.0 :weight 'regular)
   #+END_SRC

*** icons

#+begin_src emacs-lisp
  (use-package all-the-icons)
#+end_src

*** emojis

** Colored Parens

[[https://github.com/Fanael/rainbow-delimiters][rainbow-delimiters]] is useful in programming modes because it colorizes nested parentheses and brackets according to their nesting depth.  This makes it a lot easier to visually match parentheses in Emacs Lisp code without having to count them yourself.

#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :hook
    (prog-mode . rainbow-delimiters-mode))
#+end_src

show-paren-mode

#+begin_src emacs-lisp
  (add-hook 'after-init-hook 'show-paren-mode)
#+end_src

** Command Log Mode

[[https://github.com/lewang/command-log-mode][command-log-mode]] is useful for displaying a panel showing each key binding you use in a panel on the right side of the frame.  Great for live streams and screencasts!

#+begin_src emacs-lisp
  (use-package command-log-mode
    :commands command-log-mode)
#+end_src

** Color Theme

run =M-x counsel-load-theme= to choose between them easily.

#+begin_src emacs-lisp
(use-package doom-themes
  :init (load-theme 'doom-gruvbox-light t))
#+end_src

** Better Modeline

check out the [[https://github.com/seagle0128/doom-modeline#customize][configuration options]] for more things you can enable or disable.

*NOTE:* The first time you load your configuration on a new machine, you'll need to run =M-x all-the-icons-install-fonts= so that mode line icons display correctly.

#+begin_src emacs-lisp
  (use-package doom-modeline
    :custom
    (doom-modeline-height 15)
    :hook
    (after-init . doom-modeline-mode))
#+end_src

* Snippets/yasnippet

#+begin_src emacs-lisp
  (use-package yasnippet
    :hook ((prog-mode conf-mode text-mode snippet-mode) . yas-minor-mode))

  (use-package yasnippet-snippets
    :after (yasnippet))

  ;; (advice-add 'company-complete-common :before (lambda ()
  ;;                                 (setq my-company-point (point))))
  ;; (advice-add 'company-complete-common :after (lambda ()
  ;;                                 (when (equal my-company-point (point)) (yas-expand))))
#+end_src

* Org Mode

** Basic Config

