.emacs.d/init.el
         ("C-M-j" . ivy-switch-buffer)
         :map ivy-minibuffer-map
         ("TAB" . ivy-alt-done)
         ("C-l" . ivy-alt-done)
         ("C-j" . ivy-next-line)
         ("C-k" . ivy-previous-line)
         :map ivy-switch-buffer-map
         ("C-k" . ivy-previous-line)
         ("C-l" . ivy-done)
         ("C-d" . ivy-switch-buffer-kill)
         :map ivy-reverse-i-search-map
         ("C-k" . ivy-previous-line)
         ("C-d" . ivy-reverse-i-search-kill))
  :custom (ivy-use-virtual-buffers t)
  :config
  (ivy-mode 1))

(use-package ivy-rich
  :after ivy
  :init
  (ivy-rich-mode 1))

(use-package counsel
  :bind (:map minibuffer-local-map
         ("C-r" . 'counsel-minibuffer-history))
  :custom
  (counsel-linux-app-format-function #'counsel-linux-app-format-function-name-only)
  :config
  (counsel-mode 1))

(use-package ivy-prescient
  :after counsel
  :custom
  (ivy-prescient-enable-filtering nil)
  :config
  ;; Uncomment the following line to have sorting remembered across sessions!
  ;(prescient-persist-mode 1)
  (ivy-prescient-mode 1))

(use-package helpful
  :commands (helpful-callable helpful-variable helpful-command helpful-key)
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  :bind
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key))

(defvar enlarge-window-height-char ?k)
(defvar shrink-window-height-char ?j)
(defvar enlarge-window-width-char ?l)
(defvar shrink-window-width-char ?h)
(defun resize-window (&optional arg)
   "Interactively resize the selected window.
Repeatedly prompt whether to enlarge or shrink the window until the
response is neither `enlarge-window-char' or `shrink-window-char'.
When called with a prefix arg, resize the window by ARG lines."
   (interactive "p")
   ;; by default arg is 1, too slow to resize
   (setq arg 3)
   (let ((prompt (format "Enlarge/Shrink window (%c/%c/%c/%c)? "
                         enlarge-window-height-char shrink-window-height-char
                         enlarge-window-width-char shrink-window-width-char))
        response)
     (while (progn
             (setq response (read-event prompt))
             (cond ((equal response enlarge-window-height-char)
                    (enlarge-window arg)
                    t)
                   ((equal response shrink-window-height-char)
                    (enlarge-window (- arg))
                    t)
                   ((equal response enlarge-window-width-char)
                    (enlarge-window-horizontally arg)
                    t)
                   ((equal response shrink-window-width-char)
                    (enlarge-window-horizontally (- arg))
                    t)
                   (t nil))))
     (push response unread-command-events)))

;; adjust font size for your system
(defvar k4i/default-font-size 200)
(defvar k4i/default-variable-font-size 200)

;; Make frame transparency overridable
;; (defvar k4i/frame-transparency '(100 . 90))

(setq inhibit-startup-message t)

(scroll-bar-mode -1) ; Disable visible scrollbar
(tool-bar-mode -1) ; Disable the toolbar
(tooltip-mode -1) ; Disable tooltips
(set-fringe-mode 10) ; Give some breathing room

(menu-bar-mode -1) ; Disable the menu bar

;; Set up the visible bell
(setq visible-bell t)

;; Set frame transparency
;; (set-frame-parameter (selected-frame) 'alpha k4i/frame-transparency)
;; (add-to-list 'default-frame-alist `(alpha . ,k4i/frame-transparency))
(set-frame-parameter (selected-frame) 'fullscreen 'maximized)
(add-to-list 'default-frame-alist '(fullscreen . maximized))

(global-display-line-numbers-mode t)
(column-number-mode) ; show column number
;; Disable line numbers for some modes
(dolist (mode '(org-mode-hook
                term-mode-hook
                shell-mode-hook
                eshell-mode-hook
                treemacs-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))

(use-package beacon
  :custom
  (beacon-lighter "")
  (beacon-size 20)
  :config
  (beacon-mode 1))

(defun k4i/show-trailing-whitespace ()
  "Enable display of trailing whitespace in this buffer."
  (setq-local show-trailing-whitespace t))

(dolist (hook '(prog-mode-hook text-mode-hook conf-mode-hook))
  (add-hook hook 'k4i/show-trailing-whitespace))

(add-hook 'before-save-hook
          'delete-trailing-whitespace)

;; M-SPC
(global-set-key [remap just-one-space] 'cycle-spacing)



(set-face-attribute 'default nil :font "DejaVu Sans Mono" :height k4i/default-font-size)

;; set the fixed pitch face
(set-face-attribute 'fixed-pitch nil :font "DejaVu Sans Mono" :height 0.9)

;; Set the variable pitch face
(set-face-attribute 'variable-pitch nil :font "Cantarell" :height 1.0 :weight 'regular)

(use-package all-the-icons)

(use-package rainbow-delimiters
  :hook
  (prog-mode . rainbow-delimiters-mode))

(add-hook 'after-init-hook 'show-paren-mode)

(use-package command-log-mode
  :commands command-log-mode)

(use-package doom-themes
  :init (load-theme 'doom-gruvbox-light t))

(use-package doom-modeline
  :custom
  (doom-modeline-height 15)
  :hook
  (after-init . doom-modeline-mode))

(use-package yasnippet
  :hook ((prog-mode conf-mode text-mode snippet-mode) . yas-minor-mode))

(use-package yasnippet-snippets
  :after (yasnippet))

;; (advice-add 'company-complete-common :before (lambda ()
;;                                 (setq my-company-point (point))))
;; (advice-add 'company-complete-common :after (lambda ()
;;                                 (when (equal my-company-point (point)) (yas-expand))))
