.emacs.d/README.org
*** Better Font Faces

The =k4i/org-font-setup= function configures various text faces to tweak the sizes of headings and use variable width fonts in most cases so that it looks more like we're editing a document in =org-mode=.  We switch back to fixed width (monospace) fonts for code blocks and tables so that they display correctly.

#+begin_src emacs-lisp
  (defun k4i/org-font-setup ()
    ;; Set faces for heading levels
    (dolist (face '((org-level-1 . 1.2)
                    (org-level-2 . 1.1)
                    (org-level-3 . 1.05)
                    (org-level-4 . 1.0)
                    (org-level-5 . 1.1)
                    (org-level-6 . 1.1)
                    (org-level-7 . 1.1)
                    (org-level-8 . 1.1)))
      (set-face-attribute (car face) nil :font "Cantarell" :weight 'bold :height (cdr face)))

    ;; Ensure that anything that should be fixed-pitch in Org files appears that way
    (set-face-attribute 'org-block nil    :foreground nil :inherit 'fixed-pitch)
    ;; (set-face-attribute 'org-table nil    :inherit 'fixed-pitch)
    (set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
    (set-face-attribute 'org-code nil     :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-table nil    :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-checkbox nil  :inherit 'fixed-pitch)
    (set-face-attribute 'line-number nil :inherit 'fixed-pitch)
    (set-face-attribute 'line-number-current-line nil :inherit 'fixed-pitch))
#+end_src

*** Org Mode

#+begin_src emacs-lisp
  (defun k4i/org-mode-setup ()
    (org-indent-mode)
    (variable-pitch-mode 1)
    (visual-line-mode 1))

  (use-package org
    :pin org
    :commands (org-capture org-agenda)
    :hook (org-mode . k4i/org-mode-setup)
    :custom
    (org-image-actual-width (/ (nth 3 (assq 'geometry (frame-monitor-attributes))) 3))
    (org-startup-folded t)
    (org-directory (expand-file-name "Org" (getenv "HOME")))
    (org-ellipsis " ▾")
    (org-agenda-start-with-log-mode t)
    ;; (org-hide-emphasis-markers t)
    (org-log-done 'time)
    (org-log-into-drawer t)
    ;; org-directory/GTD
    (org-agenda-files (list (expand-file-name "GTD" org-directory)))
    ;; tags: C-c C-q
    (org-tag-alist
     '((:startgroup)
       ("@notes" . ?n)
       ("@workspace_setup" . ?w)
       ("@Data_Structure_and_Algorithm" . ?d)
       (:endgroup)
       ("idea" . ?i)))
    :config
    (font-lock-add-keywords 'org-mode
                            '(("^ *\\([-]\\) "
                               (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

    ;; C-c C-t
    (setq org-todo-keywords
          '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d!)")
            (sequence "BACKLOG(b)" "PLAN(p)" "READY(r)" "ACTIVE(a)" "REVIEW(v)" "WAIT(w@/!)" "HOLD(h)" "|" "COMPLETED(c)" "CANC(k@)")))

    (setq org-refile-targets
          '(("Archive.org" :maxlevel . 1)
            ("Tasks.org" :maxlevel . 1)))

    ;; Save Org buffers after refiling!
    (advice-add 'org-refile :after 'org-save-all-org-buffers)

    (k4i/org-font-setup))
#+end_src

*** Nicer Heading Bullets

[[https://github.com/sabof/org-bullets][org-bullets]] replaces the heading stars in =org-mode= buffers with nicer looking characters that you can control.  Another option for this is [[https://github.com/integral-dw/org-superstar-mode][org-superstar-mode]] which we may cover in a later video.

#+begin_src emacs-lisp
  (use-package org-bullets
    :hook (org-mode . org-bullets-mode)
    :custom
    (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))
#+end_src

*** center org buffer

#+begin_src emacs-lisp
  (defun k4i/org-mode-visual-fill ()
    (setq visual-fill-column-width 100
          visual-fill-column-center-text t)
    (visual-fill-column-mode 1))

  (use-package visual-fill-column
    :hook (org-mode . k4i/org-mode-visual-fill)
    :config
    (advice-add 'text-scale-adjust :after #'visual-fill-column-adjust))
#+end_src

*** key bindings

#+begin_src emacs-lisp
  (general-evil-define-key '(normal visual insert) org-mode-map
    "M-h" 'org-metaleft
    "M-H" 'org-shiftmetaleft
    "M-l" 'org-metaright
    "M-L" 'org-shiftmetaright
    "M-j" 'org-metadown
    "M-J" 'org-shiftmetadown
    "M-k" 'org-metaup
    "M-K" 'org-shiftmetaup)
#+end_src

** Org Agenda

*** custom commands

#+begin_src emacs-lisp
  ;; Configure custom agenda views
  (with-eval-after-load 'org-agenda
    (setq org-agenda-custom-commands
          '(("d" "Dashboard"
             ((agenda "" ((org-deadline-warning-days 14)))
              (todo "NEXT"
                    ((org-agenda-overriding-header "Next Tasks")))
              (tags-todo "agenda/ACTIVE" ((org-agenda-overriding-header "Active Projects")))))

            ("n" "Next Tasks"
             ((todo "NEXT"
                    ((org-agenda-overriding-header "Next Tasks")))))

            ("w" "Workflow Status"
             ((todo "WAIT"
                    ((org-agenda-overriding-header "Waiting on External")
                     (org-agenda-files org-agenda-files)))
              (todo "REVIEW"
                    ((org-agenda-overriding-header "In Review")
                     (org-agenda-files org-agenda-files)))
              (todo "PLAN"
                    ((org-agenda-overriding-header "In Planning")
                     (org-agenda-todo-list-sublevels nil)
                     (org-agenda-files org-agenda-files)))
              (todo "BACKLOG"
                    ((org-agenda-overriding-header "Project Backlog")
                     (org-agenda-todo-list-sublevels nil)
                     (org-agenda-files org-agenda-files)))
              (todo "READY"
                    ((org-agenda-overriding-header "Ready for Work")
                     (org-agenda-files org-agenda-files)))
              (todo "ACTIVE"
                    ((org-agenda-overriding-header "Active Projects")
                     (org-agenda-files org-agenda-files)))
              (todo "COMPLETED"
                    ((org-agenda-overriding-header "Completed Projects")
                     (org-agenda-files org-agenda-files)))
              (todo "CANC"
                    ((org-agenda-overriding-header "Cancelled Projects")
                     (org-agenda-files org-agenda-files))))))))
#+end_src

*** Org Habit

#+begin_src emacs-lisp
  (with-eval-after-load 'org
    (require 'org-habit)
    (add-to-list 'org-modules 'org-habit)
    (setq org-habit-graph-column 60))
#+end_src

** Drag and Drop using org-download

#+begin_src emacs-lisp
  (use-package org-download
    :after org
    :hook ((org-mode dired-mode) . org-download-enable)
    :custom
    (org-download-image-dir "images")
    (org-dwnload-method 'directory)
    (org-download-heading-lvl nil)
    (org-download-timestamp "%Y%m%d-%H%M%S_")
    ;; (org-download-annotate-function (lambda (_link) ""))
    :bind
    ("C-M-y" .
     (lambda (&optional noask)
       (interactive "P")
       (let ((file
              (if (not noask)
                  (read-string (format "Filename [%s]: " org-download-screenshot-basename)
                               nil nil org-download-screenshot-basename)
                nil)))
         (org-download-clipboard file))))
    :config
    (require 'org-download))
#+end_src

** Org Export

*** revealjs

#+begin_src emacs-lisp
  (use-package ox-reveal
    :after ox
    :custom
    ;; or use a online revealjs
    ;; #+REVEAL_ROOT: https://cdn.jsdelivr.net/npm/reveal.js
    (org-reveal-root (concat "file://" (expand-file-name "~/app/revealjs/reveal.js-master/"))))
#+end_src

*** markdown/hugo

#+begin_src emacs-lisp
  (use-package ox-hugo
    :after ox)
#+end_src

