.emacs.d/README.org
*** latex/pdf

need to install some dependencies:

#+begin_src shell
  pip install pygments
#+end_src

#+begin_src emacs-lisp
  (with-eval-after-load 'ox-latex
    ;; http://orgmode.org/worg/org-faq.html#using-xelatex-for-pdf-export
    ;; latexmk runs pdflatex/xelatex (whatever is specified) multiple times
    ;; automatically to resolve the cross-references.
    (setq org-latex-pdf-process '("latexmk -xelatex -quiet -shell-escape -f %f"))
    ;; (setq org-latex-pdf-process '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
    (add-to-list 'org-latex-classes
                 '("elegantpaper"
                   "\\documentclass[lang=cn]{elegantpaper}
                 [NO-DEFAULT-PACKAGES]
                 [PACKAGES]
                 [EXTRA]"
                   ("\\section{%s}" . "\\section*{%s}")
                   ("\\subsection{%s}" . "\\subsection*{%s}")
                   ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                   ("\\paragraph{%s}" . "\\paragraph*{%s}")
                   ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
    (add-to-list 'org-latex-classes
                 '("beamer"
                   "\\documentclass[presentation]{beamer}"
                   ("\\section{%s}" . "\\section*{%s}")
                   ("\\subsection{%s}" . "\\subsection*{%s}")
                   ("\\subsubsection{%s}" . "\\subsubsection*{%s}")))
    (setq org-latex-listings 'minted)
    (setq org-latex-minted-options
          '(("frame" "none")
            ("linenos" "false")
            ("breaklines" "true")
            ("bgcolor" "lightgray")))
    (add-to-list 'org-latex-packages-alist '("" "minted")))
#+end_src

** Org Babel

*** Configure Babel Languages

To execute or export code in =org-mode= code blocks, you'll need to set up =org-babel-load-languages= for each language you'd like to use.  [[https://orgmode.org/worg/org-contrib/babel/languages/index.html][This page]] documents all of the languages that you can use with =org-babel=.

#+begin_src emacs-lisp
  (with-eval-after-load 'org
    (org-babel-do-load-languages
        'org-babel-load-languages
        '((emacs-lisp . t)
        (python . t)))

    (push '("conf-unix" . conf-unix) org-src-lang-modes))
#+end_src

*** Tangle Config Files

This snippet adds a hook to =org-mode= buffers so that =k4i/org-babel-tangle-config= gets executed each time such a buffer gets saved.  This function checks to see if the file being saved is inside =user-emacs-directory=, and if so, automatically exports the configuration here to the associated output files.

The line =#+PROPERTY: header-args:emacs-lisp :tangle ./init.el= at the beginning of this document tells that emacs-lisp blocks will be tangled to =./init.el=.

#+begin_src emacs-lisp
  ;; Automatically tangle our org config file in the emacs directory when we save it
  (defun k4i/org-babel-tangle-config ()
    "tangle any org-mode file inside user-emacs-directory"
    (when (string-equal (file-name-directory (buffer-file-name))

                        (let (
                              ;; (emacs-config-dir user-emacs-directory)
                              (emacs-config-dir "~/.dotfiles/.emacs.d/")
                              )
                          (expand-file-name emacs-config-dir))
                        )
      ;; Dynamic scoping to the rescue
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))

  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'k4i/org-babel-tangle-config)))
#+end_src

** Capture Templates

*** task

#+begin_src emacs-lisp
  (with-eval-after-load 'org-capture
    (add-to-list 'org-capture-templates
                 '("t" "Task"  entry
                   (file "GTD/Tasks.org")
                   "* TODO %?\nDEADLINE: %(format-time-string \"%<<%Y-%m-%d %a>>\")\n"
                   :unnarrowed t)))
#+end_src

*** Contact

#+begin_src emacs-lisp
  (with-eval-after-load 'org-capture
    (add-to-list 'org-capture-templates
                 '("c" "Contact"  entry
                   (file "GTD/Contacts.org")
                   "* %?\n:PROPERTIES:\n:ADDRESS:\n:PHONE:\n:BDAY: %(format-time-string \"%<<%Y-%m-%d %a +1y>>\")\n:EMAIL:\n:END:\n"
                   :unnarrowed t)))
#+end_src

*** habit

#+begin_src emacs-lisp
  (with-eval-after-load 'org-capture
    (add-to-list 'org-capture-templates
                 '("h" "Habit"  entry
                   (file "GTD/Habits.org")
                   "* NEXT %?\nSCHEDULED: %(format-time-string \"%<<%Y-%m-%d %a .+1d/3d>>\")\n:PROPERTIES:\n:STYLE: habit\n:REPEAT_TO_STATE: NEXT\n:END:\n"
                   :unnarrowed t)))
#+end_src

*** hugo post

#+begin_src emacs-lisp
  (defun org-hugo-new-subtree-post-capture-template ()
    "Returns `org-capture' template string for new Hugo post.
   See `org-capture-templates' for more information."
    (let* (;; http://www.holgerschurig.de/en/emacs-blog-from-org-to-hugo/
           (date (format-time-string (org-time-stamp-format :long :inactive) (org-current-time)))
           (title (read-from-minibuffer "Post Title: ")) ;Prompt to enter the post title
           (fname (org-hugo-slug title)))
      (mapconcat #'identity
                 `(
                   ,(concat "\n* TODO " title "  :@cat:tag:")
                   ":PROPERTIES:"
                   ,(concat ":EXPORT_HUGO_BUNDLE: " fname)
                   ":EXPORT_FILE_NAME: index"
                   ,(concat ":EXPORT_DATE: " date) ;Enter current date and time
                   ":EXPORT_HUGO_CUSTOM_FRONT_MATTER: :image \"/images/icons/tortoise.png\""
                   ":EXPORT_HUGO_CUSTOM_FRONT_MATTER+: :libraries '(mathjax)"
                   ":EXPORT_HUGO_CUSTOM_FRONT_MATTER+: :description \"this is a description\""
                   ":END:"
                   "%?\n")
                 "\n")))
#+end_src

#+begin_src emacs-lisp
  (with-eval-after-load 'org-capture
    (setq hugo-content-org-dir "~/git-repo/blog/blog-src/content-org")
    (add-to-list 'org-capture-templates
                 `("pe"                ;`org-capture' binding + h
                   "Hugo Post (en)"
                   entry
                   ;; It is assumed that below file is present in `org-directory'
                   ;; and that it has a "Blog Ideas" heading. It can even be a
                   ;; symlink pointing to the actual location of all-posts.org!
                   (file ,(expand-file-name "all-posts.en.org" hugo-content-org-dir))
                   (function org-hugo-new-subtree-post-capture-template)))
    (add-to-list 'org-capture-templates
                 `("pz"
                   "Hugo Post (zh)"
                   entry
                   (file ,(expand-file-name "all-posts.zh.org" hugo-content-org-dir))
                   (function org-hugo-new-subtree-post-capture-template)))
    (add-to-list 'org-capture-templates '("p" "Hugo Post")))
#+end_src

** Org Roam

*** basic

#+begin_src emacs-lisp
  (use-package org-roam
    :after org
    :init
    (setq org-roam-v2-ack t)
    :custom
    (org-roam-directory (expand-file-name "Org-Roam" org-directory))
    (org-roam-complete-everywhere t)
    :config
    (org-roam-setup)
    :bind
    (("C-c n f" . org-roam-node-find)
     ("C-c n r" . org-roam-node-random)
     :map org-mode-map
     ("C-c n i" . org-roam-node-insert)
     ("C-c n o" . org-id-get-create)
     ("C-c n t" . org-roam-tag-add)
     ("C-c n a" . org-roam-alias-add)
     ("C-c n l" . org-roam-buffer-toggle)
     ("C-M-i" . completion-at-point)))
#+end_src

*** ui

#+begin_src emacs-lisp
  (use-package org-roam-ui
    :after org-roam
    :custom
    (org-roam-ui-sync-theme t)
    (org-roam-ui-follow t)
    (org-roam-ui-update-on-save t))
#+end_src

* Development

** camelcase motion

#+begin_src emacs-lisp
  (use-package subword
    :hook (prog-mode . subword-mode)
    :diminish)
#+end_src

** symbol overlay

#+begin_src emacs-lisp
  (use-package symbol-overlay
    :hook ((prog-mode html-mode yaml-mode conf-mode) . symbol-overlay-mode)
    :bind (:map symbol-overlay-mode-map
                ("M-i" . symbol-overlay-put)
                ("M-I" . symbol-overlay-remove-all)
                ("M-n" . symbol-overlay-jump-next)
                ("M-p" . symbol-overlay-jump-prev))
   :diminish)
#+end_src

** flycheck

#+begin_src emacs-lisp
      (use-package flycheck
        :init (global-flycheck-mode)
        :custom
        (flycheck-display-errors-function #'flycheck-display-error-messages-unless-error-list))
#+end_src

